Revit 2024 API
BuiltInFailures.ConversionFailures.CannotConvertToDouble Property
 Cannot convert '[Text] ' to double value
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotConvertToDouble { get; }
Visual Basic
Public Shared ReadOnly Property CannotConvertToDouble As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotConvertToDouble {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ConversionFailures Class
Autodesk.Revit.DB Namespace